# GetOriginalMemberIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseArray..::..GetOriginalMemberIds Method
BaseArray Class See Also
---
Retrieves the original member Ids of the Array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public abstract ICollection<ElementId> GetOriginalMemberIds()
```

Visual Basic
---
```text
Public MustOverride Function GetOriginalMemberIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
virtual ICollection<ElementId^>^ GetOriginalMemberIds() abstract
```

# ### Return Value
The original member Ids of the Array
# See Also
BaseArray Class
Autodesk.Revit.DB Namespace